<a href="https://colab.research.google.com/github/anu-mohan/Ds_pythoncode/blob/main/classwork_methods.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [40]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("http://rcs.bu.edu/examples/python/data_analysis/Salaries.csv")

##classwork 1

In [4]:
df.count   #how many records this dataframe has
df.shape

<bound method DataFrame.count of          rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]>

In [5]:
df.size #total element

468

In [6]:
df.columns # what are the  columns name

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [7]:
len(df.columns)   #how many columns are there

6

In [16]:
df.dtypes  #what type of columns we have in this dataframe

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

##method

In [21]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [33]:
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [23]:
df.tail(10)

         rank discipline  phd  service     sex  salary
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [24]:
df.min()

rank          AssocProf
discipline            A
phd                   1
service               0
sex              Female
salary            57800
dtype: object

In [25]:
df.max()

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [26]:
df.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [27]:
df.median()

phd            18.5
service        14.5
salary     104671.0
dtype: float64

In [28]:
df.sample()

    rank discipline  phd  service     sex  salary
51  Prof          B   20       14  Female  127512

In [29]:
df.dropna()

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [30]:
df.sample(10)

         rank discipline  phd  service     sex  salary
14       Prof          B   25       19    Male  153750
6   AssocProf          A   20       17    Male   81285
34  AssocProf          B   12        8    Male  119800
28   AsstProf          B    7        2    Male   91300
56  AssocProf          A   10        8  Female   77500
47  AssocProf          B   11       11  Female  103613
29       Prof          B   21       20    Male  123683
18       Prof          A   19        7    Male  107300
25       Prof          B   35       31    Male   99418
76       Prof          A   28       14  Female  109954

In [31]:
df.discipline

0     B
1     A
2     A
3     A
4     B
     ..
73    B
74    B
75    B
76    A
77    A
Name: discipline, Length: 78, dtype: object

In [32]:
df.discipline.value_counts

<bound method IndexOpsMixin.value_counts of 0     B
1     A
2     A
3     A
4     B
     ..
73    B
74    B
75    B
76    A
77    A
Name: discipline, Length: 78, dtype: object>

##classwork 2

In [34]:
df.describe()  #give the summary for the numeric columns in the dataset

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [35]:
df.std()  #calculate the standard deviation for all columns

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [47]:
#step1        #first method
df_50=df.head(50)            #what are the mean values of the first 50  records in the dataset

In [48]:
#step2
df_50.mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [49]:
df.head(50).mean()  #second method

phd            21.52
service        17.60
salary     113789.14
dtype: float64

##selecting a columns in a dataframe

In [51]:
df['salary']

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

In [57]:
df[['salary']]   #if we use [[]] then we will get the output in proper table form

    salary
0   186960
1    93000
2   110515
3   131205
4   104800
..     ...
73  105450
74  104542
75  124312
76  109954
77  109646

[78 rows x 1 columns]

In [53]:
df.salary.head(10)

0    186960
1     93000
2    110515
3    131205
4    104800
5    122400
6     81285
7    126300
8     94350
9     57800
Name: salary, dtype: int64

In [54]:
df.phd.count     #find how many values in the phd columns

<bound method Series.count of 0     56
1     12
2     23
3     40
4     20
      ..
73    18
74    19
75    17
76    28
77    23
Name: phd, Length: 78, dtype: int64>

In [56]:
df.phd.mean()     #calculate the average phd

19.705128205128204

In [58]:
df.phd.describe()  #calculate the basic statistics for phd column

count    78.000000
mean     19.705128
std      12.498425
min       1.000000
25%      10.250000
50%      18.500000
75%      27.750000
max      56.000000
Name: phd, dtype: float64